import { createRoot } from 'react-dom/client'
import { App } from './App'
import './index.scss'

const root = document.getElementById('root')

export const text = `ВАЖНО — ПРОЧТИТЕ ВНИМАТЕЛЬНО!
Настоящее лицензионное соглашение (далее «соглашение») является юридическим 
документом, заключаемым между вами (физическим или юридическим лицом) 
и изготовителем (далее «изготовитель») вычислительной техники или ее компонента (далее 
«компьютер» или «аппаратное обеспечение»), вместе с которым вы приобрели программное 
обеспечение корпорации Microsoft (далее «программа» или «программное обеспечение»), 
указанное выше. Если программа не сопровождает новый компьютер или оборудование, 
ее использование и копирование запрещается. Программа включает в себя собственно 
программное обеспечение, записанное на соответствующих носителях, а также может 
включать печатные материалы и «встроенную» или «электронную» документацию. Любые 
программные компоненты, предоставленные совместно с программным обеспечением, 
правила пользования которым определяются отдельным лицензионным соглашением, 
предоставляются на условиях последнего.`

createRoot(root).render(<App />)